## staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_quicksight_data_set.notifications_refreshed`         |
|        | `aws_quicksight_refresh_schedule.notifications-refreshed` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
19:07:37.715 STDOUT terraform:   + create
19:07:37.715 STDOUT terraform: Terraform will perform the following actions:
19:07:37.716 STDOUT terraform:   # aws_quicksight_data_set.notifications_refreshed will be created
19:07:37.716 STDOUT terraform:   + resource "aws_quicksight_data_set" "notifications_refreshed" {
19:07:37.716 STDOUT terraform:       + arn            = (known after apply)
19:07:37.716 STDOUT terraform:       + aws_account_id = (known after apply)
19:07:37.716 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
19:07:37.716 STDOUT terraform:       + id             = (known after apply)
19:07:37.716 STDOUT terraform:       + import_mode    = "SPICE"
19:07:37.716 STDOUT terraform:       + name           = "Notifications Refreshing"
19:07:37.716 STDOUT terraform:       + output_columns = (known after apply)
19:07:37.716 STDOUT terraform:       + region         = "ca-central-1"
19:07:37.716 STDOUT terraform:       + tags_all       = (known after apply)
19:07:37.716 STDOUT terraform:       + data_set_usage_configuration (known after apply)
19:07:37.716 STDOUT terraform:       + logical_table_map {
19:07:37.716 STDOUT terraform:           + alias                = "Notifications with Services"
19:07:37.716 STDOUT terraform:           + logical_table_map_id = "notifications-with-services"
19:07:37.716 STDOUT terraform:           + data_transforms (known after apply)
19:07:37.716 STDOUT terraform:           + source {
19:07:37.716 STDOUT terraform:               + data_set_arn      = (known after apply)
19:07:37.716 STDOUT terraform:               + physical_table_id = (known after apply)
19:07:37.716 STDOUT terraform:               + join_instruction {
19:07:37.716 STDOUT terraform:                   + left_operand  = "logical-notifications"
19:07:37.717 STDOUT terraform:                   + on_clause     = "notifications.service_id = services.service_id"
19:07:37.717 STDOUT terraform:                   + right_operand = "logical-services"
19:07:37.717 STDOUT terraform:                   + type          = "INNER"
19:07:37.717 STDOUT terraform:                   + left_join_key_properties (known after apply)
19:07:37.717 STDOUT terraform:                   + right_join_key_properties (known after apply)
19:07:37.717 STDOUT terraform:                 }
19:07:37.717 STDOUT terraform:             }
19:07:37.717 STDOUT terraform:         }
19:07:37.717 STDOUT terraform:       + logical_table_map {
19:07:37.717 STDOUT terraform:           + alias                = "notifications"
19:07:37.717 STDOUT terraform:           + logical_table_map_id = "logical-notifications"
19:07:37.717 STDOUT terraform:           + data_transforms {
19:07:37.717 STDOUT terraform:               + cast_column_type_operation (known after apply)
19:07:37.717 STDOUT terraform:               + create_columns_operation (known after apply)
19:07:37.717 STDOUT terraform:               + filter_operation (known after apply)
19:07:37.717 STDOUT terraform:               + project_operation (known after apply)
19:07:37.717 STDOUT terraform:               + rename_column_operation {
19:07:37.717 STDOUT terraform:                   + column_name     = "id"
19:07:37.717 STDOUT terraform:                   + new_column_name = "notification_id"
19:07:37.717 STDOUT terraform:                 }
19:07:37.717 STDOUT terraform:               + tag_column_operation (known after apply)
19:07:37.717 STDOUT terraform:               + untag_column_operation (known after apply)
19:07:37.717 STDOUT terraform:             }
19:07:37.717 STDOUT terraform:           + source {
19:07:37.717 STDOUT terraform:               + data_set_arn      = (known after apply)
19:07:37.717 STDOUT terraform:               + physical_table_id = "notifications"
19:07:37.717 STDOUT terraform:               + join_instruction (known after apply)
19:07:37.717 STDOUT terraform:             }
19:07:37.718 STDOUT terraform:         }
19:07:37.718 STDOUT terraform:       + logical_table_map {
19:07:37.718 STDOUT terraform:           + alias                = "services"
19:07:37.718 STDOUT terraform:           + logical_table_map_id = "logical-services"
19:07:37.718 STDOUT terraform:           + data_transforms {
19:07:37.718 STDOUT terraform:               + cast_column_type_operation (known after apply)
19:07:37.718 STDOUT terraform:               + create_columns_operation (known after apply)
19:07:37.718 STDOUT terraform:               + filter_operation (known after apply)
19:07:37.718 STDOUT terraform:               + project_operation (known after apply)
19:07:37.718 STDOUT terraform:               + rename_column_operation {
19:07:37.718 STDOUT terraform:                   + column_name     = "id"
19:07:37.718 STDOUT terraform:                   + new_column_name = "service_id"
19:07:37.718 STDOUT terraform:                 }
19:07:37.718 STDOUT terraform:               + tag_column_operation (known after apply)
19:07:37.718 STDOUT terraform:               + untag_column_operation (known after apply)
19:07:37.718 STDOUT terraform:             }
19:07:37.718 STDOUT terraform:           + data_transforms {
19:07:37.718 STDOUT terraform:               + cast_column_type_operation (known after apply)
19:07:37.718 STDOUT terraform:               + create_columns_operation (known after apply)
19:07:37.718 STDOUT terraform:               + filter_operation (known after apply)
19:07:37.718 STDOUT terraform:               + project_operation (known after apply)
19:07:37.718 STDOUT terraform:               + rename_column_operation {
19:07:37.718 STDOUT terraform:                   + column_name     = "name"
19:07:37.718 STDOUT terraform:                   + new_column_name = "service_name"
19:07:37.718 STDOUT terraform:                 }
19:07:37.718 STDOUT terraform:               + tag_column_operation (known after apply)
19:07:37.718 STDOUT terraform:               + untag_column_operation (known after apply)
19:07:37.718 STDOUT terraform:             }
19:07:37.718 STDOUT terraform:           + source {
19:07:37.718 STDOUT terraform:               + data_set_arn      = (known after apply)
19:07:37.718 STDOUT terraform:               + physical_table_id = "services"
19:07:37.719 STDOUT terraform:               + join_instruction (known after apply)
19:07:37.719 STDOUT terraform:             }
19:07:37.719 STDOUT terraform:         }
19:07:37.719 STDOUT terraform:       + permissions {
19:07:37.719 STDOUT terraform:           + actions   = [
19:07:37.719 STDOUT terraform:               + "quicksight:CancelIngestion",
19:07:37.719 STDOUT terraform:               + "quicksight:CreateIngestion",
19:07:37.719 STDOUT terraform:               + "quicksight:DeleteDataSet",
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeDataSet",
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeIngestion",
19:07:37.719 STDOUT terraform:               + "quicksight:ListIngestions",
19:07:37.719 STDOUT terraform:               + "quicksight:PassDataSet",
19:07:37.719 STDOUT terraform:               + "quicksight:UpdateDataSet",
19:07:37.719 STDOUT terraform:               + "quicksight:UpdateDataSetPermissions",
19:07:37.719 STDOUT terraform:             ]
19:07:37.719 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
19:07:37.719 STDOUT terraform:         }
19:07:37.719 STDOUT terraform:       + permissions {
19:07:37.719 STDOUT terraform:           + actions   = [
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeDataSet",
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
19:07:37.719 STDOUT terraform:               + "quicksight:DescribeIngestion",
19:07:37.719 STDOUT terraform:               + "quicksight:ListIngestions",
19:07:37.719 STDOUT terraform:               + "quicksight:PassDataSet",
19:07:37.719 STDOUT terraform:             ]
19:07:37.719 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
19:07:37.719 STDOUT terraform:         }
19:07:37.719 STDOUT terraform:       + physical_table_map {
19:07:37.719 STDOUT terraform:           + physical_table_map_id = "notifications"
19:07:37.719 STDOUT terraform:           + relational_table {
19:07:37.719 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
19:07:37.720 STDOUT terraform:               + name            = "notifications"
19:07:37.720 STDOUT terraform:                 # (2 unchanged attributes hidden)
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "id"
19:07:37.720 STDOUT terraform:                   + type = "STRING"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "billable_units"
19:07:37.720 STDOUT terraform:                   + type = "INTEGER"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "created_at"
19:07:37.720 STDOUT terraform:                   + type = "DATETIME"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "queue_name"
19:07:37.720 STDOUT terraform:                   + type = "STRING"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "sent_at"
19:07:37.720 STDOUT terraform:                   + type = "DATETIME"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "notification_status"
19:07:37.720 STDOUT terraform:                   + type = "STRING"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.720 STDOUT terraform:                   + name = "notification_type"
19:07:37.720 STDOUT terraform:                   + type = "STRING"
19:07:37.720 STDOUT terraform:                 }
19:07:37.720 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "updated_at"
19:07:37.721 STDOUT terraform:                   + type = "DATETIME"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "job_id"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "api_key_id"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "key_id"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "service_id"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "template_id"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "reference"
19:07:37.721 STDOUT terraform:                   + type = "STRING"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "sms_total_message_price"
19:07:37.721 STDOUT terraform:                   + type = "DECIMAL"
19:07:37.721 STDOUT terraform:                 }
19:07:37.721 STDOUT terraform:               + input_columns {
19:07:37.721 STDOUT terraform:                   + name = "sms_total_carrier_fee"
19:07:37.721 STDOUT terraform:                   + type = "DECIMAL"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "sms_iso_country_code"
19:07:37.722 STDOUT terraform:                   + type = "STRING"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "sms_carrier_name"
19:07:37.722 STDOUT terraform:                   + type = "STRING"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "sms_message_encoding"
19:07:37.722 STDOUT terraform:                   + type = "STRING"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "sms_origination_phone_number"
19:07:37.722 STDOUT terraform:                   + type = "STRING"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:             }
19:07:37.722 STDOUT terraform:           + s3_source (known after apply)
19:07:37.722 STDOUT terraform:         }
19:07:37.722 STDOUT terraform:       + physical_table_map {
19:07:37.722 STDOUT terraform:           + physical_table_map_id = "services"
19:07:37.722 STDOUT terraform:           + relational_table {
19:07:37.722 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
19:07:37.722 STDOUT terraform:               + name            = "services"
19:07:37.722 STDOUT terraform:                 # (2 unchanged attributes hidden)
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "id"
19:07:37.722 STDOUT terraform:                   + type = "STRING"
19:07:37.722 STDOUT terraform:                 }
19:07:37.722 STDOUT terraform:               + input_columns {
19:07:37.722 STDOUT terraform:                   + name = "active"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "restricted"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "research_mode"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "count_as_live"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "go_live_at"
19:07:37.723 STDOUT terraform:                   + type = "DATETIME"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "name"
19:07:37.723 STDOUT terraform:                   + type = "STRING"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "message_limit"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "rate_limit"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.723 STDOUT terraform:               + input_columns {
19:07:37.723 STDOUT terraform:                   + name = "sms_daily_limit"
19:07:37.723 STDOUT terraform:                   + type = "INTEGER"
19:07:37.723 STDOUT terraform:                 }
19:07:37.724 STDOUT terraform:             }
19:07:37.724 STDOUT terraform:           + s3_source (known after apply)
19:07:37.724 STDOUT terraform:         }
19:07:37.724 STDOUT terraform:     }
19:07:37.724 STDOUT terraform:   # aws_quicksight_refresh_schedule.notifications-refreshed will be created
19:07:37.724 STDOUT terraform:   + resource "aws_quicksight_refresh_schedule" "notifications-refreshed" {
19:07:37.724 STDOUT terraform:       + arn            = (known after apply)
19:07:37.724 STDOUT terraform:       + aws_account_id = (known after apply)
19:07:37.724 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
19:07:37.724 STDOUT terraform:       + id             = (known after apply)
19:07:37.724 STDOUT terraform:       + region         = "ca-central-1"
19:07:37.724 STDOUT terraform:       + schedule_id    = "schedule-notifications"
19:07:37.724 STDOUT terraform:       + schedule {
19:07:37.724 STDOUT terraform:           + refresh_type          = "INCREMENTAL_REFRESH"
19:07:37.724 STDOUT terraform:           + start_after_date_time = (known after apply)
19:07:37.724 STDOUT terraform:           + schedule_frequency {
19:07:37.724 STDOUT terraform:               + interval        = "DAILY"
19:07:37.724 STDOUT terraform:               + time_of_the_day = "07:50"
19:07:37.724 STDOUT terraform:               + timezone        = (known after apply)
19:07:37.724 STDOUT terraform:             }
19:07:37.724 STDOUT terraform:         }
19:07:37.724 STDOUT terraform:     }
19:07:37.724 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
19:07:37.724 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:07:37.724 STDOUT terraform: Saved the plan to: plan.tfplan
19:07:37.724 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:07:37.724 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications_refreshed"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
